SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_irda.c
/*!
    \file    gd32e23x_hal_irda.c
    \brief   IRDA driver
    
    \version 2019-03-14, V1.0.0, firmware for GD32E23x
*/

/*
    Copyright (c) 2019, GigaDevice Semiconductor Inc.

    All rights reserved.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32e23x_hal.h"

static uint16_t _irda_data_bit_mask_get(hal_irda_dev_struct *irda);
static FlagStatus _irda_error_flag_get(hal_irda_dev_struct *irda);
static void _irda_transmit_complete_interrupt(void *irda);
static void _irda_transmit_interrupt(void *irda);
static void _irda_receive_interrupt(void *irda);
static void _irda_transmit_dma(void *dma);
static void _irda_receive_dma(void *dma);
static void _irda_dma_error(void *dma);

/*!
    \brief      initialize the IrDA struct with the default values, note that this function must be
                called after the structure is created
    \param[in]  hal_struct_type: type of IrDA struct for initialization
      \arg        HAL_IRDA_INIT_STRUCT: initialization structure
      \arg        HAL_IRDA_DEV_STRUCT: device information structure
      \arg        HAL_IRDA_USER_CALLBCAK_STRUCT: user callback struct
    \param[in]  p_struct: structure pointer
    \param[out] none
    \retval     none
*/
void hal_irda_struct_init(hal_irda_struct_type_enum hal_struct_type, void *p_struct)
{
#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == p_struct){
        HAL_DEBUGE("parameter [*p_struct] value is invalid");
        return;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    switch(hal_struct_type){
    case HAL_IRDA_INIT_STRUCT:
        /* initialize IrDA initialization structure with the default values */
        ((hal_irda_init_struct*)p_struct)->baudrate = 115200U;
        ((hal_irda_init_struct*)p_struct)->direction = IRDA_DIRECTION_RX_TX;
        ((hal_irda_init_struct*)p_struct)->parity = IRDA_PARITY_NONE;
        ((hal_irda_init_struct*)p_struct)->word_length = IRDA_WORD_LENGTH_8BIT;
        ((hal_irda_init_struct*)p_struct)->mode = IRDA_NORMAL_MODE;
        ((hal_irda_init_struct*)p_struct)->prescaler = 1U;
        break;
        
    case HAL_IRDA_DEV_STRUCT:
        /* initialize IrDA device information structure with the default values */
        ((hal_irda_dev_struct*)p_struct)->periph = 0U;
        ((hal_irda_dev_struct*)p_struct)->irda_irq.error_handle = NULL;
        ((hal_irda_dev_struct*)p_struct)->irda_irq.receive_complete_handle = NULL;
        ((hal_irda_dev_struct*)p_struct)->irda_irq.transmit_complete_handle = NULL;
        ((hal_irda_dev_struct*)p_struct)->irda_irq.transmit_ready_handle = NULL;
        ((hal_irda_dev_struct*)p_struct)->p_dma_rx = NULL;
        ((hal_irda_dev_struct*)p_struct)->p_dma_tx = NULL;
        ((hal_irda_dev_struct*)p_struct)->txbuffer.buffer = NULL;
        ((hal_irda_dev_struct*)p_struct)->txbuffer.length = 0U;
        ((hal_irda_dev_struct*)p_struct)->txbuffer.pos = 0U;
        ((hal_irda_dev_struct*)p_struct)->rxbuffer.buffer = NULL;
        ((hal_irda_dev_struct*)p_struct)->rxbuffer.length = 0U;
        ((hal_irda_dev_struct*)p_struct)->rxbuffer.pos = 0U;
        ((hal_irda_dev_struct*)p_struct)->error_state = HAL_USART_ERROR_NONE;
        ((hal_irda_dev_struct*)p_struct)->tx_state = IRDA_STATE_FREE;
        ((hal_irda_dev_struct*)p_struct)->rx_state = IRDA_STATE_FREE;
        ((hal_irda_dev_struct*)p_struct)->last_error = HAL_USART_ERROR_NONE;
        ((hal_irda_dev_struct*)p_struct)->priv = NULL;      /* priv data */

    case HAL_IRDA_USER_CALLBCAK_STRUCT:
        /* initialize user callback structure with the default values */
        ((hal_irda_user_callback_struct*)p_struct)->complete_func = NULL;
        ((hal_irda_user_callback_struct*)p_struct)->error_func = NULL;
        break;
    
    default:
        HAL_DEBUGW("parameter [hal_struct_type] value is undefine");
        break;
    }
}

/*!
    \brief      deinitialize the IrDA
    \param[in]  irda: IrDA device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_irda_deinit(hal_irda_dev_struct *irda)
{
    uint32_t periph;
    
    periph = irda->periph;
    if(USART0 == periph){
        /* deinitialize the periph and the device information sturcture */
        usart_deinit(periph);
        hal_irda_struct_init(HAL_IRDA_DEV_STRUCT, irda);
        irda->periph = periph;
    }else{
        HAL_DEBUGE("parameter [irda->periph] value is invalid");
    }
}

/*!
    \brief      initialize the IrDA with specified values
    \param[in]  irda: IrDA device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  periph: specify which USART is initialized, USART0 only
    \param[in]  p_init: the initialization data needed to initialize IrDA
                  baudrate: communication baudrate
                  parity: IRDA_PARITY_NONE, IRDA_PARITY_EVEN, IRDA_PARITY_ODD
                  word_length: IRDA_WORD_LENGTH_8BIT, IRDA_WORD_LENGTH_9BIT
                  direction: IRDA_DIRECTION_RX_TX, IRDA_DIRECTION_RX_ONLY, IRDA_DIRECTION_TX_ONLY
                  mode: IRDA_NORMAL_MODE, IRDA_LOW_POWER_MODE
                  prescaler: 1 - 255
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL details refer to gd32e23x_hal.h
*/
int32_t hal_irda_init(hal_irda_dev_struct *irda, uint32_t periph, \
                      hal_irda_init_struct *p_init)
{
    uint32_t reg_temp;
    
