SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_irda.c
#if (1 == HAL_PARAMETER_CHECK)
    /* check IrDA pointer and p_init address */
    if((NULL == irda) || (NULL == p_init)){
        HAL_DEBUGE("pointer [irda] or [p_init] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    
    /* check periph parameter */
    if(USART0 != periph){
        HAL_DEBUGE("parameter [periph] value is invalid"); 
        return HAL_ERR_VAL;
    }
    
    /* check periph value from IrDA device struct */
    if(0U != irda->periph){
        HAL_DEBUGI("periph value from irda device struct has been rewrite");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    irda->periph = periph;
    usart_disable(periph);
    
    /* CTL0 register configure */
    reg_temp = USART_CTL0(periph);
    reg_temp &= ~(USART_CTL0_PM | USART_CTL0_PCEN | USART_CTL0_WL | \
                  USART_CTL0_REN | USART_CTL0_TEN);
    reg_temp |= (p_init->direction | p_init->parity | p_init->word_length);
    USART_CTL0(periph) = reg_temp;
    
    /* boudrate configure */
    usart_baudrate_set(periph, p_init->baudrate);
    irda->data_bit_mask = _irda_data_bit_mask_get(irda);
    
    /* reset the Rx and Tx state */
    irda->tx_state = IRDA_STATE_FREE;
    irda->rx_state = IRDA_STATE_FREE;
    
    /* configure the IrDA low power mode */
    usart_irda_lowpower_config(periph, p_init->mode);
    usart_irda_mode_enable(periph);
    
    return HAL_ERR_NONE;
}
 
/*!
    \brief      start IrDA module, note that this function must be called to start USART after initialization
    \param[in]  irda: IrDA device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_irda_start(hal_irda_dev_struct *irda)
{
    usart_enable(irda->periph);
}

/*!
    \brief      stop IrDA module
    \param[in]  irda: IrDA device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_irda_stop(hal_irda_dev_struct *irda)
{
    usart_disable(irda->periph);
}

/*!
    \brief      handle the IrDA interrupts
    \param[in]  irda: IrDA device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_irda_irq(hal_irda_dev_struct *irda)
{
    if(RESET == _irda_error_flag_get(irda)){
        /* check whether USART is in receiver mode or not */
        if(RESET != usart_interrupt_flag_get(irda->periph, USART_INT_FLAG_RBNE)){
            if(NULL != irda->irda_irq.receive_complete_handle){
                irda->irda_irq.receive_complete_handle(irda);
            }
            return;
        }
    }else{
        /* check whether the PERR flag is set or not */
        if(RESET != usart_interrupt_flag_get(irda->periph, USART_INT_FLAG_PERR)){
            usart_interrupt_flag_clear(irda->periph, USART_INT_FLAG_PERR);
            irda->error_state |= HAL_USART_ERROR_PERR;
            irda->last_error = HAL_USART_ERROR_PERR;
        }
        
        /* check whether the NERR flag is set or not */
        if(RESET != usart_interrupt_flag_get(irda->periph, USART_INT_FLAG_ERR_NERR)){
            usart_interrupt_flag_clear(irda->periph, USART_INT_FLAG_ERR_NERR);
            irda->error_state |= HAL_USART_ERROR_NERR;
            irda->last_error = HAL_USART_ERROR_NERR;
        }
        
        /* check whether the FERR flag is set or not */
        if(RESET != usart_interrupt_flag_get(irda->periph, USART_INT_FLAG_ERR_FERR)){
            usart_interrupt_flag_clear(irda->periph, USART_INT_FLAG_ERR_FERR);
            irda->error_state |= HAL_USART_ERROR_FERR;
            irda->last_error = HAL_USART_ERROR_FERR;
        }
        
        /* check whether the ERR ORERR is set or not */
        if(RESET != usart_interrupt_flag_get(irda->periph, USART_INT_FLAG_ERR_ORERR)){ 
            usart_interrupt_flag_clear(irda->periph, USART_INT_FLAG_ERR_ORERR);
            irda->error_state |= HAL_USART_ERROR_ORERR;
            irda->last_error = HAL_USART_ERROR_ORERR;
        }
        
        /* check whether RBNE ORERR is set or not */
        if(RESET != usart_interrupt_flag_get(irda->periph, USART_INT_FLAG_RBNE_ORERR)){ 
            usart_interrupt_flag_clear(irda->periph, USART_INT_FLAG_RBNE_ORERR);
            irda->error_state |= HAL_USART_ERROR_ORERR;
            irda->last_error = HAL_USART_ERROR_ORERR;
        }
       
        /* check whether error state is none or not */
        if(HAL_USART_ERROR_NONE != irda->error_state){
            if(NULL != irda->irda_irq.error_handle){
                irda->irda_irq.error_handle(irda);
                irda->error_state = HAL_USART_ERROR_NONE;
            }
            return;
        }
    }
    
    /* transmitter buffer empty interrupt handle */
    if(RESET != usart_interrupt_flag_get(irda->periph, USART_INT_FLAG_TBE)){
        if(NULL != irda->irda_irq.transmit_ready_handle){
            irda->irda_irq.transmit_ready_handle(irda);
        }
        return;
    }
    
    /* transmission complete interrupt handle */
    if(RESET != usart_interrupt_flag_get(irda->periph, USART_INT_FLAG_TC)){
        usart_interrupt_flag_clear(irda->periph, USART_INT_FLAG_TC);
        
        if(NULL != irda->irda_irq.transmit_complete_handle){
            irda->irda_irq.transmit_complete_handle(irda);
        }
        return;
    }
}

/*!
    \brief      set user-defined interrupt callback function, 
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  irda: IrDA device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: point to IrDA interrupt callback functions structure
                  The structure member can be assigned as following parameters:
      \arg        hal_irq_handle_cb function pointer: the function is user-defined,
                    the corresponding callback mechanism is in use, and enable corresponding interrupt
      \arg        NULL: The corresponding callback mechanism is out of use, and
                    disable corresponding interrupt
      \arg        HAL_INTERRUPT_ENABLE_ONLY: The corresponding callback mechanism is out of use, 
                    while enable corresponding interrupt
    \param[out] none
    \retval     none
*/
void hal_irda_irq_handle_set(hal_irda_dev_struct *irda, hal_irda_irq_struct *p_irq)
{
    /* set user-defined error interrupt callback */
    if(NULL != p_irq->error_handle){
        irda->irda_irq.error_handle = p_irq->error_handle;
        usart_interrupt_enable(irda->periph, USART_INT_ERR);
        usart_interrupt_enable(irda->periph, USART_INT_PERR);
    }else{
        irda->irda_irq.error_handle = NULL;
        usart_interrupt_disable(irda->periph, USART_INT_ERR);
        usart_interrupt_disable(irda->periph, USART_INT_PERR);
    }
    
