SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_irda.c
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == irda) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [irda] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the rx_state wheher is busy or not */
    if(IRDA_STATE_BUSY == irda->rx_state){
        HAL_DEBUGE("irda rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
    /* calculate the data length */
    data_length = 1U;
    if(RESET != (USART_CTL0(irda->periph) & USART_CTL0_WL)){
        if(RESET == (USART_CTL0(irda->periph) & USART_CTL0_PCEN)){
            data_length = 2U;
        }
    }
    
    /* initialize receive parameters */
    irda->error_state = HAL_USART_ERROR_NONE;
    irda->rxbuffer.buffer = (uint8_t *)p_buffer; 
    irda->rxbuffer.length = length;
    irda->rxbuffer.pos = 0U;
    irda->data_bit_mask = _irda_data_bit_mask_get(irda);
    irda->rx_state = IRDA_STATE_BUSY;
    /* configure timeout */
    tick_start = hal_basetick_count_get();
    
    temp_val = irda->rxbuffer.pos;
    while(temp_val < irda->rxbuffer.length){
        /* wait for read data buffer not empty */
        while(RESET == usart_flag_get(irda->periph, USART_FLAG_RBNE)){
            if(HAL_TIMEOUT_FOREVER != timeout_ms){
                if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                    HAL_DEBUGW("irda receive timeout");
                    /* reset the state */
                    irda->rx_state = IRDA_STATE_FREE;
                    return HAL_ERR_TIMEOUT;
                }
            }
        }
        
        /* read data from data register */
        if(1U == data_length){
            *irda->rxbuffer.buffer = (uint8_t)(usart_data_receive(irda->periph) & irda->data_bit_mask);
            irda->rxbuffer.buffer++;
        }else{
            *(uint16_t*)irda->rxbuffer.buffer = (usart_data_receive(irda->periph) & irda->data_bit_mask);
             irda->rxbuffer.buffer += data_length;
        }
        
        /* change the receive pointer */
        irda->rxbuffer.pos++;
        temp_val = irda->rxbuffer.pos;
    }
    
    /* change the Rx state to free */
    irda->rx_state = IRDA_STATE_FREE;

    return HAL_ERR_NONE;
}

/*!
    \brief      transmit amounts of data by interrupt method, after the transfer is completed, 
                the user function is called
                the function is non-blocking
    \param[in]  irda: IrDA device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be transmitted
    \param[in]  p_user_func: user callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32e23x_hal.h
*/
int32_t hal_irda_transmit_interrupt(hal_irda_dev_struct *irda, void *p_buffer, \
                                     uint32_t length, hal_irda_user_cb p_user_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == irda) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [irda] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the tx_state wheher is busy or not */
    if(IRDA_STATE_BUSY == irda->tx_state){
        HAL_DEBUGE("irda tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
    /* initialize transmit parameters */
    irda->tx_state = IRDA_STATE_BUSY;
    irda->error_state = HAL_USART_ERROR_NONE;
    irda->txbuffer.buffer = (uint8_t *)p_buffer; 
    irda->txbuffer.length = length;
    irda->txbuffer.pos = 0U;
    irda->tx_callback = (void *)p_user_func;
    /* configure the transmit ready and complete callback as the function implemented */
    irda->irda_irq.transmit_ready_handle = _irda_transmit_interrupt;
    irda->irda_irq.transmit_complete_handle = _irda_transmit_complete_interrupt;
    
    /* clear USART TC interrupt flag */
    usart_interrupt_flag_clear(irda->periph, USART_INT_FLAG_TC);

    /* enable the TBE interrupt */
    usart_interrupt_enable(irda->periph, USART_INT_TBE);
    
    return HAL_ERR_NONE;
}

/*!
    \brief      receive amounts of data by interrupt method, after the transfer is completed, 
                the user function is called
                the function is non-blocking
    \param[in]  irda: IrDA device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be received
    \param[in]  p_user_func: user callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32e23x_hal.h
*/
int32_t hal_irda_receive_interrupt(hal_irda_dev_struct *irda, void *p_buffer, \
                                    uint32_t length, hal_irda_user_cb p_user_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == irda) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [irda] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the rx_state wheher is busy or not */
    if(IRDA_STATE_BUSY == irda->rx_state){
        HAL_DEBUGE("irda rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
    /* initialize receive parameters */
    irda->rx_state = IRDA_STATE_BUSY;
    irda->error_state = HAL_USART_ERROR_NONE;
    irda->rxbuffer.buffer = (uint8_t *)p_buffer; 
    irda->rxbuffer.length = length;
    irda->rxbuffer.pos = 0U;
    irda->rx_callback = (void *)p_user_func;
    irda->irda_irq.receive_complete_handle = _irda_receive_interrupt;
    irda->data_bit_mask = _irda_data_bit_mask_get(irda);
    
    /* enable PERR, ERR, RBNE interrupt */
    usart_interrupt_enable(irda->periph, USART_INT_PERR);
    usart_interrupt_enable(irda->periph, USART_INT_ERR);
    usart_interrupt_enable(irda->periph, USART_INT_RBNE);
    
