SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_irda.c
    return HAL_ERR_NONE;
}

/*!
    \brief      transmit amounts of data by DMA method, after the transfer is completed or error occurs, 
                the user function is called
                the function is non-blocking
    \param[in]  irda: IrDA device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be transmitted
    \param[in]  p_func: pointer to callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32e23x_hal.h
*/
int32_t hal_irda_transmit_dma(hal_irda_dev_struct *irda, void *p_buffer, \
                              uint32_t length, hal_irda_user_callback_struct *p_func)
{
    hal_dma_irq_struct dma_irq;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == irda) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [irda] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
    
    /* check the parameter */
    if(NULL == irda->p_dma_tx){
        HAL_DEBUGE("parameter [irda->p_dma_tx] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the tx_state wheher is busy or not */
    if(IRDA_STATE_BUSY == irda->tx_state){
        HAL_DEBUGE("irda tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
    /* initialize DMA interrupt callback function structure with default value */
    hal_dma_struct_init(HAL_DMA_IRQ_STRUCT, &dma_irq);
    
    /* initialize transmit parameters */
    irda->tx_state = IRDA_STATE_BUSY;
    irda->error_state = HAL_USART_ERROR_NONE;
    irda->txbuffer.buffer = (uint8_t *)p_buffer; 
    irda->txbuffer.length = length;
    irda->txbuffer.pos = 0U;
    if(NULL != p_func){
        irda->tx_callback = (void *)p_func->complete_func;
        irda->irda_irq.error_handle = (hal_irq_handle_cb)p_func->error_func;
    }else{
        irda->tx_callback = NULL;
        irda->irda_irq.error_handle = NULL;
    }
    irda->irda_irq.transmit_complete_handle = _irda_transmit_complete_interrupt;
    
    /* configure DMA interrupt callback function */
    dma_irq.full_finish_handle = _irda_transmit_dma;
    dma_irq.error_handle = _irda_dma_error;
    if(NULL != irda->p_dma_tx->dma_irq.half_finish_handle){
        dma_irq.half_finish_handle = irda->p_dma_tx->dma_irq.half_finish_handle;
    }
    
    /* start DMA interrupt mode transfer */
    hal_dma_start_interrupt(irda->p_dma_tx, (uint32_t)irda->txbuffer.buffer, \
                           irda->periph + 0x28U, length, &dma_irq);
    /* clear DMA global interrupt flag */
    dma_flag_clear(irda->p_dma_tx->channel, DMA_FLAG_G);
    
    /* clear USART TC interrupt flag */
    usart_interrupt_flag_clear(irda->periph, USART_INT_FLAG_TC);

    /* DMA enable for transmission */
    usart_dma_transmit_config(irda->periph, USART_DENT_ENABLE);
    
    return HAL_ERR_NONE;
}

/*!
    \brief      receive amounts of data by DMA method, after the transfer is completed or error occurs, 
                the user function is called
                the function is non-blocking
    \param[in]  irda: IrDA device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be received
    \param[in]  p_func: pointer to callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32e23x_hal.h
*/
int32_t hal_irda_receive_dma(hal_irda_dev_struct *irda, void *p_buffer, \
                              uint32_t length, hal_irda_user_callback_struct *p_func)
{
    hal_dma_irq_struct dma_irq;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == irda) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [irda] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
    
    /* check the parameter */
    if(NULL == irda->p_dma_rx){
        HAL_DEBUGE("parameter [irda->p_dma_rx] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the rx_state wheher is busy or not */
    if(IRDA_STATE_BUSY == irda->rx_state){
        HAL_DEBUGE("irda rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
    /* initialize DMA interrupt callback function structure with default value */
    hal_dma_struct_init(HAL_DMA_IRQ_STRUCT, &dma_irq);
    
    /* initialize receive parameters */
    irda->rx_state = IRDA_STATE_BUSY;
    irda->error_state = HAL_USART_ERROR_NONE;
    irda->rxbuffer.buffer = (uint8_t *)p_buffer; 
    irda->rxbuffer.length = length;
    irda->rxbuffer.pos = 0U;
    if(NULL != p_func){
        irda->rx_callback = (void *)p_func->complete_func;
        irda->irda_irq.error_handle = (hal_irq_handle_cb)p_func->error_func;
    }else{
        irda->rx_callback = NULL;
        irda->irda_irq.error_handle = NULL;
    }
    irda->data_bit_mask = _irda_data_bit_mask_get(irda);
    
    /* enable the usart parity error and error interrupt: (frame error, noise error, overrun error)  */
    usart_interrupt_enable(irda->periph, USART_INT_PERR);
    usart_interrupt_enable(irda->periph, USART_INT_ERR);
    
    /* configure DMA interrupt interrupt callback function */
    dma_irq.full_finish_handle = _irda_receive_dma;
    dma_irq.error_handle = _irda_dma_error;
    if(NULL != irda->p_dma_rx->dma_irq.half_finish_handle){
        dma_irq.half_finish_handle = irda->p_dma_rx->dma_irq.half_finish_handle;
    }
    
    /* start DMA interrupt mode transfer */
    hal_dma_start_interrupt(irda->p_dma_rx, irda->periph + 0x24U, \
                           (uint32_t)irda->rxbuffer.buffer, length, &dma_irq);
    /* clear DMA global interrupt flag */
    dma_flag_clear(irda->p_dma_tx->channel, DMA_FLAG_G);
    /* DMA enable for reception */
    usart_dma_receive_config(irda->periph, USART_DENR_ENABLE);
    
