SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_irda.c
    return HAL_ERR_NONE;
}

/*!
    \brief      pause IrDA DMA transfer during transmission process
    \param[in]  irda: IrDA device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32e23x_hal.h
*/
int32_t hal_irda_dma_pause(hal_irda_dev_struct *irda)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == irda){
        HAL_DEBUGE("parameter [irda] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the tx_state wheher is busy or not */
    if(IRDA_STATE_BUSY == irda->tx_state){
        /* disable DMA transimt */
        usart_dma_transmit_config(irda->periph, USART_DENT_DISABLE);
    }
    
    /* check the rx_state wheher is busy or not */
    if(IRDA_STATE_BUSY == irda->rx_state){
        /* disable the PERR and ERR interrupt */
        usart_interrupt_disable(irda->periph, USART_INT_PERR);
        usart_interrupt_disable(irda->periph, USART_INT_ERR);
        
        /* disable DMA receive */
        usart_dma_receive_config(irda->periph, USART_DENR_DISABLE);
    }
    return HAL_ERR_NONE;
}

/*!
    \brief      resume IrDA DMA transfer during transmission process
    \param[in]  irda: IrDA device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32e23x_hal.h
*/
int32_t hal_irda_dma_resume(hal_irda_dev_struct *irda)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == irda){
        HAL_DEBUGE("parameter [irda] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the tx_state wheher is busy or not */
    if(IRDA_STATE_BUSY == irda->tx_state){
        /* enable DMA transimt */
        usart_dma_transmit_config(irda->periph, USART_DENT_ENABLE);
    }
    
    /* check the rx_state wheher is busy or not */
    if(IRDA_STATE_BUSY == irda->rx_state){
        /* enable the PERR and ERR interrupt */
        usart_interrupt_enable(irda->periph, USART_INT_PERR);
        usart_interrupt_enable(irda->periph, USART_INT_ERR);
        
        /* enable DMA receive */
        usart_dma_receive_config(irda->periph, USART_DENR_ENABLE);
    }
    return HAL_ERR_NONE;
}

/*!
    \brief      stop IrDA transmit transfer
                the function is blocking
    \param[in]  irda: IrDA device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32e23x_hal.h
*/
int32_t hal_irda_transmit_stop(hal_irda_dev_struct *irda)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == irda){
        HAL_DEBUGE("parameter [irda] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* disable the TBE and TC interrupt */
    usart_interrupt_disable(irda->periph, USART_INT_TBE);
    usart_interrupt_disable(irda->periph, USART_INT_TC);
    
    /* disable DMA transimt and stop DMA */
    usart_dma_transmit_config(irda->periph, USART_DENT_DISABLE);
    hal_dma_stop(irda->p_dma_tx);
    
    /* reset the position and state */
    irda->txbuffer.pos = 0;
    irda->tx_state = IRDA_STATE_FREE;
    
    return HAL_ERR_NONE;
}

/*!
    \brief      stop IrDA receive transfer
                the function is blocking
    \param[in]  irda: IrDA device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32e23x_hal.h
*/
int32_t hal_irda_receive_stop(hal_irda_dev_struct *irda)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == irda){
        HAL_DEBUGE("parameter [irda] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* disable the RBNE, PERR and ERR interrupt */
    usart_interrupt_disable(irda->periph, USART_INT_RBNE);
    usart_interrupt_disable(irda->periph, USART_INT_PERR);
    usart_interrupt_disable(irda->periph, USART_INT_ERR);
    
    /* disable DMA receive and stop DMA */
    usart_dma_receive_config(irda->periph, USART_DENR_DISABLE);
    hal_dma_stop(irda->p_dma_rx);
    
    /* reset the position and state */
    irda->rxbuffer.pos = 0;
    irda->rx_state = IRDA_STATE_FREE;
    
    /* clear interrupt error flags */
    usart_interrupt_flag_clear(irda->periph, USART_INT_FLAG_PERR);
    usart_interrupt_flag_clear(irda->periph, USART_INT_FLAG_ERR_FERR);
    usart_interrupt_flag_clear(irda->periph, USART_INT_FLAG_ERR_NERR);
    usart_interrupt_flag_clear(irda->periph, USART_INT_FLAG_ERR_ORERR);
    
    return HAL_ERR_NONE;
}

/*!
    \brief      configure the IrDA baudrate and prescaler, the other parameters are configured as default values
    \param[in]  irda: IrDA device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  periph: specify which USART is configured, USART0 only
    \param[in]  baud: baudrate
    \param[in]  psc: prescaler, can be set to 1 only in IrDA normal mode
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32e23x_hal.h
*/
int32_t hal_irda_simple_config(hal_irda_dev_struct *irda, uint32_t periph, uint32_t baud, uint8_t psc)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == irda){
        HAL_DEBUGE("parameter [irda] value is invalid");
        return HAL_ERR_ADDRESS;
    }
    
    /* check the parameters */
    if((USART0 != periph) || (0U == baud)){
        HAL_DEBUGE("parameter [periph] or [baud] value is invalid"); 
        return HAL_ERR_VAL;
    }
    
    /* check the parameters */
    if(0U == psc){
        HAL_DEBUGE("parameter [psc] value is invalid"); 
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the tx_state or rx_state wheher is busy or not */
    if((IRDA_STATE_BUSY == irda->tx_state) || (IRDA_STATE_BUSY == irda->rx_state)){
        HAL_DEBUGE("IrDA is in tx or rx state, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
