SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_irda.c
    irda->periph = periph;
    
    /* deinitilize USART */
    usart_deinit(periph);
    /* USART configure */
    usart_baudrate_set(periph, baud);
    usart_parity_config(periph, USART_PM_NONE);
    usart_word_length_set(periph, USART_WL_8BIT);
    usart_stop_bit_set(periph, USART_STB_1BIT);
    usart_receive_config(periph, USART_RECEIVE_ENABLE);
    usart_transmit_config(periph, USART_TRANSMIT_ENABLE);
    /* IrDA configure */
    usart_irda_lowpower_config(periph, USART_IRLP_NORMAL);
    usart_prescaler_config(periph, psc);
    usart_irda_mode_enable(periph);
    
    return HAL_ERR_NONE;
}

/*!
    \brief      get the mask of date bit
    \param[in]  irda: IrDA device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     the mask of date bit(0x7F, 0xFF, 0x1FF)
*/
static uint16_t _irda_data_bit_mask_get(hal_irda_dev_struct *irda)
{
    uint16_t reval;
    
    if(RESET != (USART_CTL0(irda->periph) & USART_CTL0_WL)){
        /* check whether the PCEN is enabled */
        if(RESET != (USART_CTL0(irda->periph) & USART_CTL0_PCEN)){
            reval = 0xFFU;
        }else{
            reval = 0x1FFU;
        }
    }else{
        /* check whether the PCEN is enabled */
        if(RESET != (USART_CTL0(irda->periph) & USART_CTL0_PCEN)){
            reval = 0x7FU;
        }else{
            reval = 0xFFU;
        }
    }
    
    return reval;
}

/*!
    \brief      get IrDA error flag
    \param[in]  irda: IrDA device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     SET or RESET
*/
static FlagStatus _irda_error_flag_get(hal_irda_dev_struct *irda)
{
    if(0U == (USART_STAT(irda->periph) & (uint32_t)(USART_STAT_PERR | USART_STAT_FERR | \
                                                    USART_STAT_ORERR | USART_STAT_NERR))){
        return RESET;
    }else{
        return SET;
    }
}

/*!
    \brief      handle the transmit complete interrupt
    \param[in]  irda: pointer to a IrDA device information structure
    \param[out] none
    \retval     none
*/
static void _irda_transmit_complete_interrupt(void *irda)
{
    hal_irda_dev_struct *p_irda = irda;
    hal_irda_user_cb p_func = (hal_irda_user_cb)p_irda->tx_callback;
    
    /* disable the transmit complete interrupt */
    usart_interrupt_disable(p_irda->periph, USART_INT_TC);
    /* reset transmit_complete_handle and tx_state */
    p_irda->irda_irq.transmit_complete_handle = NULL;
    p_irda->tx_state = IRDA_STATE_FREE;
    
    if(NULL != p_func){
        /* if there is a user transmit complete callback */
        p_func(p_irda);
    }
}

/*!
    \brief      handle the transmit interrupt
    \param[in]  irda: pointer to a IrDA device information structure
    \param[out] none
    \retval     none
*/
static void _irda_transmit_interrupt(void *irda)
{
    uint32_t temp_val;
    hal_irda_dev_struct *p_irda = irda;
    
    temp_val = p_irda->txbuffer.pos;
    if(temp_val < p_irda->txbuffer.length){
        if((RESET != (USART_CTL0(p_irda->periph) & USART_CTL0_WL)) && \
           (RESET == (USART_CTL0(p_irda->periph) & USART_CTL0_PCEN))){
            /* 9-bit data, none parity */
            usart_data_transmit(p_irda->periph, (*(uint16_t*)p_irda->txbuffer.buffer & (uint16_t)0x1FFU));
            p_irda->txbuffer.buffer += 2U;
        }else{
            /* 9-bit data, with parity or 8-bit data */
            usart_data_transmit(p_irda->periph, (*p_irda->txbuffer.buffer & (uint8_t)0xFFU));
            p_irda->txbuffer.buffer++;
        }
        p_irda->txbuffer.pos++;
    }else{
        /* disable the TBE interrupt, enable the TC interrupt and reset the transmit_ready_handle */
        usart_interrupt_disable(p_irda->periph, USART_INT_TBE);
        usart_interrupt_enable(p_irda->periph, USART_INT_TC);
        p_irda->irda_irq.transmit_ready_handle = NULL;
    }
}

/*!
    \brief      handle the receive interrupt
    \param[in]  irda: pointer to a IrDA device information structure
    \param[out] none
    \retval     none
*/
static void _irda_receive_interrupt(void *irda)
{
    uint16_t recv_data;
    hal_irda_dev_struct *p_irda = irda;
    uint32_t temp_val;
    
    recv_data = (usart_data_receive(p_irda->periph) & p_irda->data_bit_mask);
    if(0x1FFU == p_irda->data_bit_mask){
        /* store the received data */
        *(uint16_t *)p_irda->rxbuffer.buffer = recv_data;
        p_irda->rxbuffer.buffer += 2U;
    }else{
        /* store the received data */
        *p_irda->rxbuffer.buffer = (uint8_t)recv_data;
        p_irda->rxbuffer.buffer++;
    }
    p_irda->rxbuffer.pos++;
    
    temp_val = p_irda->rxbuffer.pos;
    if(temp_val == p_irda->rxbuffer.length){
        hal_irda_user_cb p_func = (hal_irda_user_cb)p_irda->rx_callback;
        /* disable PERR, ERR, RBNE interrupt */
        usart_interrupt_disable(p_irda->periph, USART_INT_PERR);
        usart_interrupt_disable(p_irda->periph, USART_INT_ERR);
        usart_interrupt_disable(p_irda->periph, USART_INT_RBNE);
        /* reset receive_complete_handle and rx_state */
        p_irda->irda_irq.receive_complete_handle = NULL;
        p_irda->rx_state = IRDA_STATE_FREE;
        
        if(NULL != p_func){
            /* if there is a user receive complete callback */
            p_func(p_irda);
        }
    }
}

/*!
    \brief      handle the IrDA DMA transmit process
    \param[in]  dma: pointer to a DMA device information structure
    \param[out] none
    \retval     none
*/
static void _irda_transmit_dma(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_irda_dev_struct *p_irda;
    
    p_dma = (hal_dma_dev_struct*)dma;
    p_irda = (hal_irda_dev_struct*)p_dma->p_periph;
    /* DMA normal mode */
    if(RESET == (DMA_CHCTL(p_dma->channel) & DMA_CHXCTL_CMEN)){
        p_irda->txbuffer.pos = p_irda->txbuffer.length;
        usart_dma_transmit_config(p_irda->periph, USART_DENT_DISABLE);
        /* enable TC interrupt */
        usart_interrupt_enable(p_irda->periph, USART_INT_TC);
    }
}

/*!
    \brief      handle the IrDA DMA receive process
    \param[in]  dma: pointer to a DMA device information structure
    \param[out] none
    \retval     none
*/
static void _irda_receive_dma(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_irda_dev_struct *p_irda;
    hal_irda_user_cb p_func;
    
    p_dma = (hal_dma_dev_struct*)dma;
    p_irda = (hal_irda_dev_struct*)p_dma->p_periph;
    p_func = (hal_irda_user_cb)p_irda->rx_callback;
    /* DMA normal mode */
    if(RESET == (DMA_CHCTL(p_dma->channel) & DMA_CHXCTL_CMEN)){
        p_irda->rxbuffer.pos = p_irda->rxbuffer.length;
        /* disable DMA receive, PERR and ERR interrupt */
        usart_dma_receive_config(p_irda->periph, USART_DENR_DISABLE);
        usart_interrupt_disable(p_irda->periph, USART_INT_PERR);
        usart_interrupt_disable(p_irda->periph, USART_INT_ERR);
        /* reset rx_state */
        p_irda->rx_state = IRDA_STATE_FREE;
    }
    
    if(NULL != p_func){
        /* if there is a user receive complete callback */
        p_func(p_irda);
    }
}

/*!
    \brief      handle the IrDA DMA error process
    \param[in]  dma: pointer to a DMA device information structure
    \param[out] none
    \retval     none
*/
static void _irda_dma_error(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_irda_dev_struct *p_irda;
    
    p_dma = (hal_dma_dev_struct*)dma;
    p_irda = (hal_irda_dev_struct*)p_dma->p_periph;

    if(IRDA_STATE_BUSY == p_irda->tx_state){
        /* transmit state is busy */
        p_irda->error_state |= HAL_USART_ERROR_DMATX;
        p_irda->last_error = HAL_USART_ERROR_DMATX;
        p_irda->txbuffer.pos = p_irda->txbuffer.length;
        /* disable DMA transmit and reset tx_state */
        usart_dma_transmit_config(p_irda->periph, USART_DENT_DISABLE);
        p_irda->tx_state = IRDA_STATE_FREE;
    }else if(IRDA_STATE_BUSY == p_irda->rx_state){
        /* receive state is busy */
        p_irda->error_state |= HAL_USART_ERROR_DMARX;
        p_irda->last_error = HAL_USART_ERROR_DMARX;
        p_irda->rxbuffer.pos = p_irda->rxbuffer.length;
        /* disable DMA receive, PERR, ERR interrupt */
        usart_dma_receive_config(p_irda->periph, USART_DENR_DISABLE);
        usart_interrupt_disable(p_irda->periph, USART_INT_PERR);
        usart_interrupt_disable(p_irda->periph, USART_INT_ERR);
        /* reset rx_state */
        p_irda->rx_state = IRDA_STATE_FREE;
    }else{
        HAL_DEBUGE("irda processor fatal error: dma error exception due to run state");
    }

    if(p_irda->irda_irq.error_handle != NULL){
        /* if there is a user error callback */
        p_irda->irda_irq.error_handle(p_irda);
        p_irda->error_state = HAL_USART_ERROR_NONE;
    }
}
